# CorrectionFactorSet Properties

---
The CorrectionFactorSet type exposes the following members.
| Name| Description
---|---|---
| IsEmpty| Test to see if the set is empty.
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| Size| Returns the number of correction factors that are in the set.
Top
#### Reference
CorrectionFactorSet Class
Autodesk.Revit.DB.Electrical Namespace